{"0": "High-School", "1": "Bachelors", "2": "Masters", "3": "Professional degree", "4": "Doctorate", "5": "For how many years have you been writing code and/or programming?", "6": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - Python", "7": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - R", "8": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - SQL", "9": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - C", "10": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - C++", "11": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - Javascript", "12": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - MATLAB", "13": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - None", "14": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice - Jupyter (JupyterLab, Jupyter Notebooks, etc) ", "15": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  RStudio ", "16": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  Visual Studio / Visual Studio Code ", "17": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  PyCharm ", "18": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  MATLAB ", "19": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice - None", "20": "For how many years have you used machine learning methods?", "21": "Uses ML Framework Count", "22": "Uses ML Algorithms Count", "23": "Uses Computer Vision Algorithms Count", "24": "Uses NLP Algorithms Count", "25": "Uses Auto ML tools Count", "26": "Uses Business Intel tools Count", "27": "Uses Big Data Products Count", "28": "Has Managed ML tools Count", "29": "Knows Cloud Compute Platforms Count", "30": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Analyze and understand data to influence product or business decisions", "31": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run the data infrastructure that my business uses for storing, analyzing, and operationalizing data", "32": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build prototypes to explore applying machine learning to new areas", "33": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run a machine learning service that operationally improves my product or workflows", "34": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Experimentation and iteration to improve existing ML models", "35": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Do research that advances the state of the art of machine learning", "36": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - None of these activities are an important part of my role at work", "37": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Other", "38": "For how many years have you used machine learning methods?", "39": "Approximately how many times have you used a TPU (tensor processing unit)?", "40": "Approximately how much money have you (or your team) spent on machine learning and/or cloud computing services at home (or at work) in the past 5 years (approximate $USD)?", "41": "Academics/Education", "42": "Computers/Technology", "43": "Insurance/Risk Assessment", "44": "Manufacturing/Fabrication", "45": "Medical/Pharmaceutical", "46": "Online Service/Internet-based Services", "47": "Retail/Sales", "48": "Other", "49": "What is your current yearly compensation (approximate $USD)?", "50": "Target"}