{"21": "What is your current yearly compensation (approximate $USD)?", "22": "Approximately how much money have you (or your team) spent on machine learning and/or cloud computing services at home (or at work) in the past 5 years (approximate $USD)?", "9": "In what industry is your current employer/contract (or your most recent employer if retired)? - Selected Choice", "11": "Approximately how many individuals are responsible for data science workloads at your place of business?", "63": "Uses Computer Vision Algorithms Count", "10": "What is the size of the company where you are employed?", "62": "Uses ML Algorithms Count", "12": "Does your current employer incorporate machine learning methods into their business?", "61": "Uses ML Framework Count", "85": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Doctorate", "8": "For how many years have you used machine learning methods?", "1": "What type of computing platform do you use most often for your data science projects? - Selected Choice", "64": "Uses NLP Algorithms Count", "3": "Which types of specialized hardware do you use on a regular basis?  (Select all that apply) - Selected Choice -  NVIDIA GPUs ", "17": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Experimentation and iteration to improve existing ML models", "67": "Uses Big Data Products Count", "14": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run the data infrastructure that my business uses for storing, analyzing, and operationalizing data", "52": "Who/what are your favorite media sources that report on data science topics? (Select all that apply) - Selected Choice - Journal Publications (peer-reviewed journals, conference proceedings, etc)", "15": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build prototypes to explore applying machine learning to new areas", "18": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Do research that advances the state of the art of machine learning", "13": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Analyze and understand data to influence product or business decisions", "16": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run a machine learning service that operationally improves my product or workflows", "66": "Uses Business Intel tools Count", "7": "Approximately how many times have you used a TPU (tensor processing unit)?", "65": "Uses Auto ML tools Count", "27": "Do you use any tools to help manage machine learning experiments? (Select all that apply) - Selected Choice -  TensorBoard ", "0": "What programming language would you recommend an aspiring data scientist to learn first? - Selected Choice", "43": "What is the primary tool that you use at work or school to analyze data? (Include text response) - Selected Choice", "19": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - None of these activities are an important part of my role at work", "58": "Uses IDE for dev Count", "60": "Uses Data Visualization libs Count", "56": "Has taken DS Course Count", "36": "Where do you publicly share your data analysis or machine learning applications? (Select all that apply) - Selected Choice -  GitHub ", "84": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Bachelors", "89": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_None", "2": "Which types of specialized hardware do you use on a regular basis?  (Select all that apply) - Selected Choice - CPUs"}