{"21": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Other", "63": "Uses ML Algorithms Count", "85": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Bachelors", "62": "Uses ML Framework Count", "61": "Uses Data Visualization libs Count", "1": "What programming language would you recommend an aspiring data scientist to learn first? - Selected Choice", "9": "For how many years have you used machine learning methods?", "8": "Approximately how many times have you used a TPU (tensor processing unit)?", "64": "Uses Computer Vision Algorithms Count", "3": "Which types of specialized hardware do you use on a regular basis?  (Select all that apply) - Selected Choice - CPUs", "52": "Who/what are your favorite media sources that report on data science topics? (Select all that apply) - Selected Choice - Blogs (Towards Data Science, Analytics Vidhya, etc)", "67": "Uses Business Intel tools Count", "18": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Experimentation and iteration to improve existing ML models", "14": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Analyze and understand data to influence product or business decisions", "0": "Select the title most similar to your current role (or most recent title if retired): - Selected Choice", "17": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run a machine learning service that operationally improves my product or workflows", "7": "Which types of specialized hardware do you use on a regular basis?  (Select all that apply) - Selected Choice - Other", "27": "Do you use any tools to help manage machine learning experiments? (Select all that apply) - Selected Choice -  Sacred + Omniboard ", "22": "What is your current yearly compensation (approximate $USD)?", "84": "Has Managed ML tools", "16": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build prototypes to explore applying machine learning to new areas", "19": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Do research that advances the state of the art of machine learning", "15": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run the data infrastructure that my business uses for storing, analyzing, and operationalizing data", "66": "Uses Auto ML tools Count", "58": "Knows Pgm Lang Count", "65": "Uses NLP Algorithms Count", "11": "What is the size of the company where you are employed?", "2": "What type of computing platform do you use most often for your data science projects? - Selected Choice", "10": "In what industry is your current employer/contract (or your most recent employer if retired)? - Selected Choice", "69": "Has Managed ML tools Count", "12": "Approximately how many individuals are responsible for data science workloads at your place of business?", "13": "Does your current employer incorporate machine learning methods into their business?", "36": "Where do you publicly share your data analysis or machine learning applications? (Select all that apply) - Selected Choice -  NBViewer ", "60": "Uses Notebooks for dev Count", "56": "Who/what are your favorite media sources that report on data science topics? (Select all that apply) - Selected Choice - Other", "47": "Who/what are your favorite media sources that report on data science topics? (Select all that apply) - Selected Choice - Reddit (r/machinelearning, etc)"}