{"112": "What is your current yearly compensation (approximate $USD)?", "249": "Uses Computer Vision Algorithms Count", "271": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Doctorate", "247": "Uses ML Framework Count", "248": "Uses ML Algorithms Count", "145": "Which of the following big data products (relational database, data warehouse, data lake, or similar) do you use most often? - Selected Choice", "39": "What type of computing platform do you use most often for your data science projects? - Selected Choice", "100": "In what industry is your current employer/contract (or your most recent employer if retired)? - Selected Choice", "58": "For how many years have you used machine learning methods?", "250": "Uses NLP Algorithms Count", "6": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - Javascript", "41": "Which types of specialized hardware do you use on a regular basis?  (Select all that apply) - Selected Choice -  NVIDIA GPUs ", "15": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  RStudio ", "1": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - R", "216": "Who/what are your favorite media sources that report on data science topics? (Select all that apply) - Selected Choice - Journal Publications (peer-reviewed journals, conference proceedings, etc)", "16": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  Visual Studio / Visual Studio Code ", "110": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - None of these activities are an important part of my role at work", "65": "Which of the following machine learning frameworks do you use on a regular basis? (Select all that apply) - Selected Choice -  Xgboost ", "81": "Which of the following ML algorithms do you use on a regular basis? (Select all that apply): - Selected Choice - Convolutional Neural Networks", "90": "Which categories of computer vision methods do you use on a regular basis?  (Select all that apply) - Selected Choice - Image classification and other general purpose networks (VGG, Inception, ResNet, ResNeXt, NASNet, EfficientNet, etc)", "109": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Do research that advances the state of the art of machine learning", "108": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Experimentation and iteration to improve existing ML models", "253": "Uses Big Data Products Count", "106": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build prototypes to explore applying machine learning to new areas", "107": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run a machine learning service that operationally improves my product or workflows", "49": "What data visualization libraries or tools do you use on a regular basis?  (Select all that apply) - Selected Choice -  Ggplot / ggplot2 ", "113": "Approximately how much money have you (or your team) spent on machine learning and/or cloud computing services at home (or at work) in the past 5 years (approximate $USD)?", "13": "What programming language would you recommend an aspiring data scientist to learn first? - Selected Choice", "22": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  MATLAB ", "5": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - Java", "80": "Which of the following ML algorithms do you use on a regular basis? (Select all that apply): - Selected Choice - Dense Neural Networks (MLPs, etc)", "89": "Which categories of computer vision methods do you use on a regular basis?  (Select all that apply) - Selected Choice - Object detection methods (YOLOv3, RetinaNet, etc)", "114": "Which of the following cloud computing platforms do you use on a regular basis? (Select all that apply) - Selected Choice -  Amazon Web Services (AWS) ", "105": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run the data infrastructure that my business uses for storing, analyzing, and operationalizing data", "0": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - Python", "45": "Approximately how many times have you used a TPU (tensor processing unit)?"}