{"112": "What is your current yearly compensation (approximate $USD)?", "113": "Approximately how much money have you (or your team) spent on machine learning and/or cloud computing services at home (or at work) in the past 5 years (approximate $USD)?", "100": "In what industry is your current employer/contract (or your most recent employer if retired)? - Selected Choice", "102": "Approximately how many individuals are responsible for data science workloads at your place of business?", "145": "Which of the following big data products (relational database, data warehouse, data lake, or similar) do you use most often? - Selected Choice", "249": "Uses Computer Vision Algorithms Count", "101": "What is the size of the company where you are employed?", "248": "Uses ML Algorithms Count", "103": "Does your current employer incorporate machine learning methods into their business?", "247": "Uses ML Framework Count", "271": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Doctorate", "58": "For how many years have you used machine learning methods?", "39": "What type of computing platform do you use most often for your data science projects? - Selected Choice", "250": "Uses NLP Algorithms Count", "41": "Which types of specialized hardware do you use on a regular basis?  (Select all that apply) - Selected Choice -  NVIDIA GPUs ", "108": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Experimentation and iteration to improve existing ML models", "253": "Uses Big Data Products Count", "105": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run the data infrastructure that my business uses for storing, analyzing, and operationalizing data", "216": "Who/what are your favorite media sources that report on data science topics? (Select all that apply) - Selected Choice - Journal Publications (peer-reviewed journals, conference proceedings, etc)", "15": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  RStudio ", "1": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - R", "81": "Which of the following ML algorithms do you use on a regular basis? (Select all that apply): - Selected Choice - Convolutional Neural Networks", "106": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build prototypes to explore applying machine learning to new areas", "90": "Which categories of computer vision methods do you use on a regular basis?  (Select all that apply) - Selected Choice - Image classification and other general purpose networks (VGG, Inception, ResNet, ResNeXt, NASNet, EfficientNet, etc)", "109": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Do research that advances the state of the art of machine learning", "104": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Analyze and understand data to influence product or business decisions", "114": "Which of the following cloud computing platforms do you use on a regular basis? (Select all that apply) - Selected Choice -  Amazon Web Services (AWS) ", "6": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - Javascript", "107": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run a machine learning service that operationally improves my product or workflows", "252": "Uses Business Intel tools Count", "45": "Approximately how many times have you used a TPU (tensor processing unit)?", "251": "Uses Auto ML tools Count", "80": "Which of the following ML algorithms do you use on a regular basis? (Select all that apply): - Selected Choice - Dense Neural Networks (MLPs, etc)", "16": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  Visual Studio / Visual Studio Code ", "89": "Which categories of computer vision methods do you use on a regular basis?  (Select all that apply) - Selected Choice - Object detection methods (YOLOv3, RetinaNet, etc)", "131": "Which of the following big data products (relational databases, data warehouses, data lakes, or similar) do you use on a regular basis? (Select all that apply) - Selected Choice - PostgreSQL "}