{"103": "Does your current employer incorporate machine learning methods into their business?", "58": "For how many years have you used machine learning methods?", "112": "What is your current yearly compensation (approximate $USD)?", "247": "Uses ML Framework Count", "100": "In what industry is your current employer/contract (or your most recent employer if retired)? - Selected Choice", "243": "Knows Pgm Lang Count", "244": "Uses IDE for dev Count", "246": "Uses Data Visualization libs Count", "271": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Doctorate", "242": "Has taken DS Course Count", "248": "Uses ML Algorithms Count", "102": "Approximately how many individuals are responsible for data science workloads at your place of business?", "101": "What is the size of the company where you are employed?", "207": "What is the primary tool that you use at work or school to analyze data? (Include text response) - Selected Choice", "253": "Uses Big Data Products Count", "113": "Approximately how much money have you (or your team) spent on machine learning and/or cloud computing services at home (or at work) in the past 5 years (approximate $USD)?", "39": "What type of computing platform do you use most often for your data science projects? - Selected Choice", "255": "Knows Cloud Compute Platforms Count", "104": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Analyze and understand data to influence product or business decisions", "13": "What programming language would you recommend an aspiring data scientist to learn first? - Selected Choice", "106": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build prototypes to explore applying machine learning to new areas", "273": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Masters", "270": "What is the highest level of formal education that you have attained or plan to attain within the next 2 years?_Bachelors", "14": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice - Jupyter (JupyterLab, Jupyter Notebooks, etc) ", "211": "Who/what are your favorite media sources that report on data science topics? (Select all that apply) - Selected Choice - Kaggle (notebooks, forums, etc)", "46": "What data visualization libraries or tools do you use on a regular basis?  (Select all that apply) - Selected Choice -  Matplotlib ", "16": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  Visual Studio / Visual Studio Code ", "47": "What data visualization libraries or tools do you use on a regular basis?  (Select all that apply) - Selected Choice -  Seaborn ", "2": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - SQL", "1": "What programming languages do you use on a regular basis? (Select all that apply) - Selected Choice - R", "15": "Which of the following integrated development environments (IDE's) do you use on a regular basis?  (Select all that apply) - Selected Choice -  RStudio ", "60": "Which of the following machine learning frameworks do you use on a regular basis? (Select all that apply) - Selected Choice -   TensorFlow ", "107": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run a machine learning service that operationally improves my product or workflows", "59": "Which of the following machine learning frameworks do you use on a regular basis? (Select all that apply) - Selected Choice -   Scikit-learn ", "41": "Which types of specialized hardware do you use on a regular basis?  (Select all that apply) - Selected Choice -  NVIDIA GPUs ", "105": "Select any activities that make up an important part of your role at work: (Select all that apply) - Selected Choice - Build and/or run the data infrastructure that my business uses for storing, analyzing, and operationalizing data"}